In [1]:
import pandas as pd

In [5]:
data = {'Month' : ['January', 'February', 'March', 'April'],
        'Expense':[ 21525220.653, 31125840.875, 23135428.768, 56245263.942]}
df = pd.DataFrame(data, columns = ['Month', 'Expense'])

In [6]:
df.head()

      Month       Expense
0   January  2.152522e+07
1  February  3.112584e+07
2     March  2.313543e+07
3     April  5.624526e+07

In [13]:
pd.options.display.float_format = '{:,.0f}'.format
df.head()

      Month    Expense
0   January 21,525,221
1  February 31,125,841
2     March 23,135,429
3     April 56,245,264

In [ ]:
pd.options.display.

In [14]:
pd.options.display.float_format = '{:,.2f}'.format
df.head()

      Month       Expense
0   January 21,525,220.65
1  February 31,125,840.88
2     March 23,135,428.77
3     April 56,245,263.94

In [16]:
pd.options.display.float_format = '${:,.2f}'.format
df.head()

      Month        Expense
0   January $21,525,220.65
1  February $31,125,840.88
2     March $23,135,428.77
3     April $56,245,263.94

In [ ]:
df.style.format({
  'cost': lambda val: f'${val:,.2f}',
})

In [ ]:
t.style.format({'Salary': '${:,.0f}'})